In [1]:
import numpy as np
import pandas as pd

In [2]:
obj = pd.Series([4,7,-5,3])

In [3]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [4]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [5]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [6]:
obj.dtypes

dtype('int64')

In [7]:
#인덱스 지정
obj2 = pd.Series([4,7,-5,3],index=['d','b','a','c'])

In [8]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [9]:
#dictionary 형태로 series를 생성 가능
sdata = {"Charies":35000,"Soyul":71000,"Hayoung":16000,"jungwu":5000}
obj3 = pd.Series(sdata)

In [10]:
obj3

Charies    35000
Hayoung    16000
Soyul      71000
jungwu      5000
dtype: int64

In [11]:
#index 이름 지정
obj3.name="Salary"
obj3.index.name="Names"
obj3

Names
Charies    35000
Hayoung    16000
Soyul      71000
jungwu      5000
Name: Salary, dtype: int64

In [12]:
#기존의 인덱스를 다른 인덱스로 변경함  인덱스는 list나 array 타입으로 선언가능
obj3.index=['A','B','C','D']
obj3

A    35000
B    16000
C    71000
D     5000
Name: Salary, dtype: int64

In [13]:
#여기서 부터는 DataFrame
#numpy array나 dictionary 를 dataframe으로 선언할수 있음
#

In [14]:
#행방향의 인덱스를  인덱스, 열방향의 인덱스를  컬럼 이라로 부를 것임
data = {"names":["Soyul","Soyul","Soyul","Charales","Charles"],
        "year":[2014,2015,2016,2015,2016],
        "points":[1.5,1.7,3.6,2.4,2.9]}
df = pd.DataFrame(data)

In [15]:
data = {"names":["Soyul","Soyul","Soyul","Charales","Charles"],
        "year":[2014,2015,2016,2015,2016],
        "points":[1.5,1.7,3.6,2.4,2.9]}

In [16]:
data['names'] = ["Soyul","Soyul","Soyul","Charales","Charles","dooly"]

In [17]:
data

{'names': ['Soyul', 'Soyul', 'Soyul', 'Charales', 'Charles', 'dooly'],
 'points': [1.5, 1.7, 3.6, 2.4, 2.9],
 'year': [2014, 2015, 2016, 2015, 2016]}

In [18]:
for key,value in data.items():
    print(key,value)

names ['Soyul', 'Soyul', 'Soyul', 'Charales', 'Charles', 'dooly']
year [2014, 2015, 2016, 2015, 2016]
points [1.5, 1.7, 3.6, 2.4, 2.9]

In [19]:
for key in data.keys():
    print(data[key])

['Soyul', 'Soyul', 'Soyul', 'Charales', 'Charles', 'dooly']
[2014, 2015, 2016, 2015, 2016]
[1.5, 1.7, 3.6, 2.4, 2.9]

In [20]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [21]:
df.columns

Index(['names', 'points', 'year'], dtype='object')

In [22]:
#데이터 만을 가져오는 numpy array 형태로 가져옴
df.values

array([['Soyul', 1.5, 2014],
       ['Soyul', 1.7, 2015],
       ['Soyul', 3.6, 2016],
       ['Charales', 2.4, 2015],
       ['Charles', 2.9, 2016]], dtype=object)

In [23]:
df.shape

(5, 3)

In [24]:
df.index.name="Num"
df.columns.name = "Info"

In [25]:
df

Info     names  points  year
Num
0        Soyul     1.5  2014
1        Soyul     1.7  2015
2        Soyul     3.6  2016
3     Charales     2.4  2015
4      Charles     2.9  2016

In [26]:
#df. 한 다음에 tab 키를 누르면 dataframe에 속한  변수나 함수 목록이 나옴
#df.

In [27]:
data

{'names': ['Soyul', 'Soyul', 'Soyul', 'Charales', 'Charles', 'dooly'],
 'points': [1.5, 1.7, 3.6, 2.4, 2.9],
 'year': [2014, 2015, 2016, 2015, 2016]}

In [28]:
data['names']= ['Soyul', 'Soyul', 'Soyul', 'Charales', 'Charles']

In [29]:
data

{'names': ['Soyul', 'Soyul', 'Soyul', 'Charales', 'Charles'],
 'points': [1.5, 1.7, 3.6, 2.4, 2.9],
 'year': [2014, 2015, 2016, 2015, 2016]}

In [30]:
#penalty 컬럼은 새롭게 추가됨
df2 = pd.DataFrame(data,columns=["year","names","points","penalty"],
                        index=["one","two","three","four","five"])

In [31]:
df2

       year     names  points penalty
one    2014     Soyul     1.5     NaN
two    2015     Soyul     1.7     NaN
three  2016     Soyul     3.6     NaN
four   2015  Charales     2.4     NaN
five   2016   Charles     2.9     NaN

In [32]:
df2.index

Index(['one', 'two', 'three', 'four', 'five'], dtype='object')

In [33]:
df2.columns

Index(['year', 'names', 'points', 'penalty'], dtype='object')

In [34]:
df2.values

array([[2014, 'Soyul', 1.5, nan],
       [2015, 'Soyul', 1.7, nan],
       [2016, 'Soyul', 3.6, nan],
       [2015, 'Charales', 2.4, nan],
       [2016, 'Charles', 2.9, nan]], dtype=object)

In [35]:
df2.shape

(5, 4)

In [36]:
df2.head()

       year     names  points penalty
one    2014     Soyul     1.5     NaN
two    2015     Soyul     1.7     NaN
three  2016     Soyul     3.6     NaN
four   2015  Charales     2.4     NaN
five   2016   Charles     2.9     NaN

In [37]:
df2.describe()

             year    points
count     5.00000  5.000000
mean   2015.20000  2.420000
std       0.83666  0.864292
min    2014.00000  1.500000
25%    2015.00000  1.700000
50%    2015.00000  2.400000
75%    2016.00000  2.900000
max    2016.00000  3.600000